const lyrics = [
    `
[00:00.60]关淑怡 - 难得有情人
[00:01.60]词：向雪怀
[00:02.60]曲：卢东尼
[00:29.74]如早春初醒 催促我的心
[00:34.95]将不可再等
[00:39.00]含情待放那岁月
[00:42.06]空出了痴心 令人动心
[00:49.57]幸福的光阴 它不会偏心
[00:54.77]将分给每颗心
[00:58.73]情缘亦远亦近 将交错一生
[01:04.39]情侣爱得更甚
[01:09.65]甜蜜地与爱人 风里飞奔
[01:14.25]高声欢呼你有情 不枉这生
[01:19.25]一声你愿意 一声我愿意
[01:24.50]惊天爱再没遗憾
[01:29.50]明月雾里照人 相爱相亲
[01:34.40]让对对的恋人 增添性感
[01:39.41]一些恋爱变恨
[01:41.56]更多恋爱故事动人
[01:44.01]划上了丝丝美感
[02:08.84]幸福的光阴 它不会偏心
[02:14.04]将分给每颗心
[02:18.05]情缘亦远亦近 将交错一生
[02:23.55]情侣爱得更甚
[02:28.90]甜蜜地与爱人 风里飞奔
[02:33.60]高声欢呼你有情 不枉这生
[02:38.55]一声你愿意 一声我愿意
[02:43.70]惊天爱再没遗憾
[02:48.71]明月雾里照人 相爱相亲
[02:53.71]让对对的恋人 增添性感
[02:58.61]一些恋爱变恨
[03:00.71]更多恋爱故事动人
[03:03.28]划上了丝丝美感
[03:08.43]一些恋爱变恨
[03:10.63]更多恋爱故事动人
[03:13.13]划上了丝丝美感
`,
`
[00:00.00]作词 : 周毅
[00:01.00]作曲 : 刘迦宁
[00:27.52]烽烟起寻爱似浪淘沙
[00:34.18]遇见她如春水映梨花
[00:40.94]挥剑断天涯相思轻放下
[00:47.68]梦中我痴痴牵挂
[00:54.76]顾不顾将相王侯
[00:56.17]管不管万世千秋
[00:57.95]求只求爱化解
[00:59.54]这万丈红尘纷乱永无休
[01:02.00]爱更爱天长地久
[01:03.77]要更要似水温柔
[01:05.45]谁在乎谁主春秋
[01:07.69]一生有爱何惧风飞沙
[01:10.80]悲白发留不住芳华
[01:14.64]抛去江山如画换她笑面如花
[01:17.83]抵过这一生空牵挂
[01:21.09]心若无怨爱恨也随她
[01:24.10]天地大情路永无涯
[01:27.68]只为她袖手天下
[02:01.03]顾不顾将相王侯
[02:02.99]管不管万世千秋
[02:04.56]求只求爱化解
[02:06.13]这万丈红尘纷乱永无休
[02:08.71]爱更爱天长地久
[02:10.67]要更要似水温柔
[02:12.14]谁在乎谁主春秋
[02:14.38]一生有爱何惧风飞沙
[02:17.44]悲白发留不住芳华
[02:21.10]抛去江山如画换她笑面如花
[02:24.62]抵过这一生空牵挂
[02:27.70]心若无怨爱恨也随她
[02:30.74]天地大情路永无涯
[02:34.37]只为她袖手天下
[02:41.21]一生有爱何惧风飞沙
[02:44.16]悲白发留不住芳华
[02:47.95]抛去江山如画换她笑面如花
[02:51.24]抵过这一生空牵挂
[02:54.32]心若无怨爱恨也随她
[02:57.43]天地大情路永无涯
[03:00.93]只为她袖手天下
[03:07.78]烽烟起寻爱似浪淘沙
[03:14.20]遇见她如春水映梨花
[03:20.92]挥剑断天涯相思轻放下
[03:27.76]梦中我痴痴牵挂
`,
`
[00:00.00] 作词 : 黄伟文
[00:01.00] 作曲 : Eric Kwok
[00:02.00] 编曲 : Eric Kwok
[00:14.17]忘掉种过的花 重新的出发 放弃理想吧
[00:23.00]别再看尘封的囍帖 你正在要搬家
[00:30.78]筑得起 人应该接受 都有日倒下
[00:37.76]其实没有一种安稳快乐 永远也不差
[00:45.55]就似这一区 曾经称得上 美满甲天下
[00:53.58]但霎眼 全街的单位 快要住满乌鸦
[01:01.26]好景不会每日常在
[01:05.12]天梯不可只往上爬
[01:08.89]爱的人 没有一生一世吗
[01:14.06]大概不需要害怕
[01:18.78]忘掉爱过的他
[01:21.59]当初的囍帖金箔印着那位他
[01:25.46]裱起婚纱照那道墙
[01:27.81]及一切美丽旧年华 明日同步拆下
[01:34.04]忘掉有过的家
[01:36.90]小餐枱、沙发、雪柜及两份红茶
[01:40.67]温馨的光境不过借出 到期拿回吗
[01:46.34]等不到下一代 是吗
[02:04.62]忘掉砌过的沙
[02:07.44]回忆的堡垒 刹那已倒下
[02:13.59]面对这 坟起的荒土 你注定学会潇洒
[02:21.17]阶砖不会拒绝磨蚀
[02:24.94]窗花不可幽禁落霞
[02:28.75]有感情 就会一生一世吗
[02:34.13]又再惋惜有用吗
[02:38.80]忘掉爱过的他
[02:41.66]当初的囍帖金箔印着那位他
[02:45.33]裱起婚纱照那道墙
[02:47.74]及一切美丽旧年华 明日同步拆下
[02:53.92]忘掉有过的家
[02:56.83]小餐枱、沙发、雪柜及两份红茶
[03:00.60]温馨的光境不过借出 到期拿回吗
[03:06.33]终须会时辰到 别怕
[03:13.23]请放下手里那锁匙 好吗
[03:28.01]监制 : Eric Kwok
`,
`
[00:00.00]少女的祈祷 - 杨千嬅 (Miriam Yeung)
[00:01.92]词：**
[00:03.84]曲：陈辉阳
[00:05.76]编曲：陈辉阳
[00:07.68]沿途与他车厢中私奔般恋爱
[00:11.68]再挤逼都不放开
[00:15.43]祈求在路上没任何的阻碍
[00:19.62]令愉快旅程变悲哀
[00:24.06]连气两次绿灯都过渡了
[00:27.56]与他再爱几公里
[00:32.06]当这盏灯转红便会别离
[00:35.81]凭运气决定我生死
[00:39.43]祈求天地放过一双恋人
[00:42.81]怕发生的永远别发生
[00:47.25]从来未顺利遇上好景降临
[00:51.55]如何能重拾信心
[00:55.05]祈求天父做十分钟好人
[00:58.68]赐我他的吻如怜悯罪人
[01:02.87]我爱主同时亦爱一位世人
[01:06.99]祈求沿途未变心请给我护荫
[01:26.77]为了他不懂祷告都敢祷告
[01:30.34]谁愿眷顾这种信徒
[01:34.21]用两手遮掩双眼专心倾诉
[01:38.21]宁愿答案望不到
[01:45.21]唯求与他车厢中可抵达未来
[01:49.33]到车毁都不放开
[01:53.27]无论路上历尽任何的伤害
[01:57.40]任由我决定爱不爱
[02:01.27]祈求天地放过一双恋人
[02:04.83]怕发生的永远别发生
[02:09.02]从来未顺利遇上好景降临
[02:13.40]如何能重拾信心
[02:17.02]祈求天父做十分钟好人
[02:20.46]赐我他的吻如怜悯罪人
[02:24.52]我爱主同时亦爱一位爱人
[02:29.02]祈求沿途未变心请给我护荫
[02:36.83]为了他不懂祷告都敢祷告
[02:40.58]谁愿眷顾这种信徒
[02:44.64]太爱他怎么想到这么恐怖
[02:48.46]对绿灯去哀求哭诉
[02:55.52]然而天父并未体恤好人
[02:58.95]到我睁开眼无明灯指引
[03:03.52]我爱主为何任我身边爱人
[03:07.58]离弃了我下了车
[03:10.64]你怎可答允
`,
`
[ti:泡沫]
[ar:G.E.M. 邓紫棋]
[al:Xposed]
[by:v_pxjwang]
[offset:0]
[00:00.00]泡沫 - G.E.M. 邓紫棋
[00:00.31]词：G.E.M. 邓紫棋
[00:00.54]曲：G.E.M. 邓紫棋
[00:00.76]OP：蜂鸟音乐
[00:00.99]SP：百纳娱乐
[00:01.24]阳光下的泡沫 是彩色的
[00:08.31]就像被骗的我 是幸福的
[00:15.33]追究什么对错 你的谎言
[00:22.38]基于你还爱我
[00:28.60]美丽的泡沫 虽然一刹花火
[00:35.73]你所有承诺 虽然都太脆弱
[00:42.78]但爱像泡沫 如果能够看破
[00:49.82]有什么难过
[00:57.81]早该知道泡沫 一触就破
[01:04.73]就像已伤的心 不胜折磨
[01:11.80]也不是谁的错 谎言再多
[01:18.85]基于你还爱我
[01:25.06]美丽的泡沫 虽然一刹花火
[01:32.18]你所有承诺 虽然都太脆弱
[01:39.26]爱本是泡沫 如果能够看破
[01:46.31]有什么难过
[01:53.35]再美的花朵 盛开过就凋落
[02:00.42]再亮眼的星 一闪过就坠落
[02:07.52]爱本是泡沫 如果能够看破
[02:14.56]有什么难过
[02:21.53]为什么难过 有什么难过
[02:35.67]为什么难过
[02:46.27]全都是泡沫 只一刹的花火
[02:53.31]你所有承诺 全部都太脆弱
[03:00.46]而你的轮廓 怪我没有看破
[03:07.41]才如此难过
[03:14.45]相爱的把握 要如何再搜索
[03:21.58]相拥着寂寞 难道就不寂寞
[03:28.66]爱本是泡沫 怪我没有看破
[03:35.65]才如此难过
[03:43.65]在雨下的泡沫 一触就破
[03:50.78]当初炽热的心 早已沉没
[03:57.71]说什么你爱我 如果骗我
[04:04.76]我宁愿你沉默
`,
`
[00:00.00]Something Just Like This - The Chainsmokers/Coldplay
[00:02.63]Lyrics by：Andrew Taggart/Christopher Martin/Guy Berryman/Jonny Buckland/Will Champion
[00:05.27]Composed by：Andrew Taggart/Christopher Martin/Guy Berryman/Jonny Buckland/Will Champion 
[00:07.91]I've been reading books of old
[00:10.44]我曾饱读古书
[00:10.44]The legends and the myths
[00:12.79]还有传说与神话
[00:12.79]Achilles and his gold
[00:15.10]阿喀琉斯和他的战利品
[00:15.10]Hercules and his gifts
[00:17.60]大力神赫拉克勒斯与他的天赋
[00:17.60]Spiderman's control
[00:19.88]蜘蛛侠的掌控力
[00:19.88]And Batman with his fists
[00:22.82]蝙蝠侠的铁拳
[00:22.82]And clearly I don't see myself upon that list
[00:26.30]显而易见我未能名列其中
[00:26.30]But she said where'd you wanna go
[00:28.98]但她问你想去往何方
[00:28.98]How much you wanna risk
[00:31.25]你甘愿冒多大的风险？
[00:31.25]I'm not looking for somebody
[00:33.41]我并不渴望
[00:33.41]With some Superhuman gifts
[00:36.08]超人般的天赋异禀
[00:36.08]Some Superhero
[00:38.39]那种超级英雄
[00:38.39]Some fairytale bliss
[00:40.83]那些童话里的天赐神力
[00:40.83]Just something I can turn to
[00:43.05]我只希望能有些依靠
[00:43.05]Somebody I can kiss
[00:45.12]吻到我爱的人就好
[00:45.12]I want something just like this
[00:47.69]我想要的不过是这些
[00:47.69]Doo doo doo doo doo doo 
[00:50.00]Doo doo doo doo doo 
[00:52.40]Doo doo doo doo doo doo  
[00:54.25]Oh I want something just like this
[00:56.99]我想要的不过是这些
[00:56.99]Doo doo doo doo doo doo 
[00:59.49]Doo doo doo doo doo
[01:01.69]Doo doo doo doo doo doo
[01:03.60]Oh I want something just like this
[01:13.20]我想要的不过是这些
[01:13.20]I want something just like this
[01:22.85]我想要的不过是这些
[01:22.85]I've been reading books of old
[01:25.03]我曾饱读古书
[01:25.03]The legends and the myths
[01:27.34]还有传说与神话
[01:27.34]The testaments they told
[01:29.69]他们口中的圣约
[01:29.69]The moon and its eclipse
[01:32.04]月儿的阴晴圆缺
[01:32.04]And Superman unrolls
[01:34.38]还有超人的出现
[01:34.38]A suit before he lifts
[01:37.69]他飞天前的装束
[01:37.69]But I'm not the kind of person that it fits
[01:40.92]而我不是这样的英雄
[01:40.92]She said where'd you wanna go
[01:43.75]她问你想去往何方
[01:43.75]How much you wanna risk
[01:45.79]你甘愿冒多大的风险？
[01:45.79]I'm not looking for somebody
[01:48.04]我并不渴望
[01:48.04]With some Superhuman gifts
[01:50.57]超人般的天赋异禀
[01:50.57]Some Superhero
[01:52.93]那种超级英雄
[01:52.93]Some fairytale bliss
[01:55.29]那些童话里的天赐神力
[01:55.29]Just something I can turn to
[01:57.61]我只希望能有些依靠
[01:57.61]Somebody I can miss
[01:59.70]有个我思念的人便好
[01:59.70]I want something just like this
[02:09.11]我想要的不过是这些
[02:09.11]I want something just like this
[02:18.16]我想要的不过是这些
[02:18.16]Oh I want something just like this
[02:21.18]我想要的不过是这些
[02:21.18]Doo doo doo doo doo doo
[02:23.28]Doo doo doo doo doo 
[02:25.53]Doo doo doo doo doo doo  
[02:27.63]Oh I want something just like this
[02:30.23]我想要的不过是这些
[02:30.23]Doo doo doo doo doo doo 
[02:32.70]Doo doo doo doo doo 
[02:34.87]Doo doo doo doo doo doo
[02:37.69]Where'd you wanna go
[02:39.62]你想去往何方
[02:39.62]How much you wanna risk
[02:41.59]你甘愿冒多大的风险？
[02:41.59]I'm not looking for somebody
[02:44.00]我并不渴望
[02:44.00]With some Superhuman gifts
[02:46.59]超人般的天赋异禀
[02:46.59]Some Superhero
[02:48.68]那种超级英雄
[02:48.68]Some fairytale bliss
[02:51.24]那些童话里的天赐神力
[02:51.24]Just something I can turn to
[02:53.51]我只希望能有些依靠
[02:53.51]Somebody I can kiss
[02:55.59]吻到我爱的人就好
[02:55.59]I want something just like this
[03:14.04]我想要的不过是这些
[03:14.04]Oh I want something just like this
[03:32.78]我想要的不过是这些
[03:32.78]Oh I want something just like this
[03:51.44]我想要的不过是这些
[03:51.44]Oh I want something just like this
[03:56.04]我想要的不过是这些
`,
`
[00:00.00]海阔天空 - BEYOND
[00:07.25]词：黄家驹
[00:13.30]曲：黄家驹
[00:19.34]今天我
[00:22.99]寒夜里看雪飘过
[00:26.01]怀着冷却了的心窝飘远方
[00:31.85]风雨里追赶
[00:34.92]雾里分不清影踪
[00:38.00]天空海阔你与我
[00:41.11]可会变
[00:42.35]谁没在变
[00:44.52]多少次
[00:47.84]迎着冷眼与嘲笑
[00:50.87]从没有放弃过心中的理想
[00:56.60]一刹那恍惚
[00:59.85]若有所失的感觉
[01:02.94]不知不觉已变淡
[01:06.06]心里爱
[01:07.20]谁明白我
[01:09.63]原谅我这一生不羁放纵爱自由
[01:16.62]也会怕有一天会跌倒oh no
[01:22.84]背弃了理想谁人都可以
[01:29.10]哪会怕有一天只你共我
[01:43.64]今天我
[01:46.98]寒夜里看雪飘过
[01:50.14]怀着冷却了的心窝飘远方
[01:55.88]风雨里追赶
[01:59.10]雾里分不清影踪
[02:02.25]天空海阔你与我
[02:05.35]可会变
[02:06.78]谁没在变
[02:08.90]原谅我这一生不羁放纵爱自由
[02:15.90]也会怕有一天会跌倒oh no
[02:22.16]背弃了理想谁人都可以
[02:28.37]哪会怕有一天只你共我oh yeah
[03:09.26]仍然自由自我
[03:12.75]永远高唱我歌
[03:15.91]走遍千里
[03:20.61]原谅我这一生不羁放纵爱自由
[03:27.62]也会怕有一天会跌倒oh no
[03:33.90]背弃了理想谁人都可以
[03:40.13]哪会怕有一天只你共我
[03:46.33]背弃了理想谁人都可以
[03:52.60]哪会怕有一天只你共我oh yeah
[03:58.17]原谅我这一生不羁放纵爱自由
[04:03.55]Oh yeah
[04:05.04]也会怕有一天会跌倒
[04:11.24]背弃了理想谁人都可以
[04:17.49]哪会怕有一天只你共我
`,
]

//渐变色
const gradient = [
`
background: rgb(22,51,29);
background: linear-gradient(178deg, rgba(22,51,29,1) 0%, rgba(213,236,228,1) 100%);
`,
`
background: rgb(16,16,16);
background: linear-gradient(129deg, rgba(16,16,16,1) 0%, rgba(7,7,7,1) 100%);
`,
`
background: rgb(66,62,61);
background: linear-gradient(81deg, rgba(66,62,61,1) 0%, rgba(89,87,85,1) 92%);
`,
`
background: rgb(241,211,171);
background: linear-gradient(96deg, rgba(241,211,171,1) 0%, rgba(200,201,165,1) 37%, rgba(249,232,181,1) 83%);
`,
`
background: rgb(240,2,5);
background: linear-gradient(11deg, rgba(240,2,5,1) 0%, rgba(7,9,10,1) 37%, rgba(112,3,15,1) 91%, rgba(8,10,11,1) 100%);
`,
`
background: rgb(0,19,26);
background: linear-gradient(94deg, rgba(0,19,26,1) 0%, rgba(0,19,26,1) 98%);
`,
`
background: rgb(224,152,68);
background: linear-gradient(89deg, rgba(224,152,68,1) 0%, rgba(164,121,151,1) 81%);
`
]

//歌单
const musicList = [
    {
        name: "难得有情人",
        singer: "关淑怡",
        cover: "./难得有情人.png",
        source: "./难得有情人.mp3",
    },
    {
        name: "天下",
        singer: "张杰",
        cover: "./天下.webp",
        source: "./天下.mp3",
    },
    {
        name: "喜帖街",
        singer: "谢安琪",
        cover: "./喜帖街.webp",
        source: "./喜帖街.mp3",
    },
    {
        name: "少女的祈祷",
        singer: "杨千嬅",
        cover: "./少女的祈祷.webp",
        source: "./少女的祈祷.mp3",
    },
    {
        name: "泡沫",
        singer: "邓紫棋",
        cover: "./泡沫.webp",
        source: "./泡沫.mp3",
    },
    {
        name: "Something Just Like This",
        singer: "The Chain smokers,Coldplay",
        cover: "./Something Just Like This.webp",
        source: "./Something Just Like This.mp3",
    },
    {
        name: "海阔天空",
        singer: "Beyond",
        cover: "./海阔天空.jpg",
        source: "./海阔天空.mp3",
    },
];

// Path: src/js/lyrics.js
export default lyrics;
export { gradient, musicList };